RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_adc.h
#define    ADC_CR1_SWTRIG_Pos                                     (1U)
#define    ADC_CR1_SWTRIG_Msk                                     (0x1U << ADC_CR1_SWTRIG_Pos)
#define    ADC_CR1_SWTRIG                                         ADC_CR1_SWTRIG_Msk

#define    ADC_CR2_TRGCFG_Pos                                     (0U)
#define    ADC_CR2_TRGCFG_Msk                                     (0x3U << ADC_CR2_TRGCFG_Pos)
#define    ADC_CR2_TRGCFG                                         ADC_CR2_TRGCFG_Msk

#define    ADC_CALR_CALEN_Pos                                     (0U)
#define    ADC_CALR_CALEN_Msk                                     (0x1U << ADC_CALR_CALEN_Pos)
#define    ADC_CALR_CALEN                                         ADC_CALR_CALEN_Msk

#define    ADC_CFGR1_PEFSEL_Pos                                   (0U)
#define    ADC_CFGR1_PEFSEL_Msk                                   (0x3U << ADC_CFGR1_PEFSEL_Pos)
#define    ADC_CFGR1_PEFSEL                                       ADC_CFGR1_PEFSEL_Msk

#define    ADC_CFGR1_CLKSEL_Pos                                   (2U)
#define    ADC_CFGR1_CLKSEL_Msk                                   (0x1U << ADC_CFGR1_CLKSEL_Pos)
#define    ADC_CFGR1_CLKSEL                                       ADC_CFGR1_CLKSEL_Msk

#define    ADC_CFGR1_BITSEL_Pos                                   (3U)
#define    ADC_CFGR1_BITSEL_Msk                                   (0x3U << ADC_CFGR1_BITSEL_Pos)
#define    ADC_CFGR1_BITSEL                                       ADC_CFGR1_BITSEL_Msk

#define    ADC_CFGR1_EXSOC_Pos                                    (5U)
#define    ADC_CFGR1_EXSOC_Msk                                    (0x1U << ADC_CFGR1_EXSOC_Pos)
#define    ADC_CFGR1_EXSOC                                        ADC_CFGR1_EXSOC_Msk

#define    ADC_CFGR1_APBCLK_PSC_Pos                               (6U)
#define    ADC_CFGR1_APBCLK_PSC_Msk                               (0x3U << ADC_CFGR1_APBCLK_PSC_Pos)
#define    ADC_CFGR1_APBCLK_PSC                                   ADC_CFGR1_APBCLK_PSC_Msk

#define    ADC_CFGR1_BUFEN_Pos                                    (8U)
#define    ADC_CFGR1_BUFEN_Msk                                    (0x1U << ADC_CFGR1_BUFEN_Pos)
#define    ADC_CFGR1_BUFEN                                        ADC_CFGR1_BUFEN_Msk

#define    ADC_CFGR1_BUFMOD_Pos                                   (9U)
#define    ADC_CFGR1_BUFMOD_Msk                                   (0x1U << ADC_CFGR1_BUFMOD_Pos)
#define    ADC_CFGR1_BUFMOD                                       ADC_CFGR1_BUFMOD_Msk

#define    ADC_CFGR1_BUFLPF_Pos                                   (10U)
#define    ADC_CFGR1_BUFLPF_Msk                                   (0x1U << ADC_CFGR1_BUFLPF_Pos)
#define    ADC_CFGR1_BUFLPF                                       ADC_CFGR1_BUFLPF_Msk

#define    ADC_CFGR1_BUFCHP_EN_Pos                                (11U)
#define    ADC_CFGR1_BUFCHP_EN_Msk                                (0x1U << ADC_CFGR1_BUFCHP_EN_Pos)
#define    ADC_CFGR1_BUFCHP_EN                                    ADC_CFGR1_BUFCHP_EN_Msk

#define    ADC_CFGR2_DMAEN_Pos                                    (0U)
#define    ADC_CFGR2_DMAEN_Msk                                    (0x1U << ADC_CFGR2_DMAEN_Pos)
#define    ADC_CFGR2_DMAEN                                        ADC_CFGR2_DMAEN_Msk

#define    ADC_CFGR2_SCANDIR_Pos                                  (2U)
#define    ADC_CFGR2_SCANDIR_Msk                                  (0x1U << ADC_CFGR2_SCANDIR_Pos)
#define    ADC_CFGR2_SCANDIR                                      ADC_CFGR2_SCANDIR_Msk

#define    ADC_CFGR2_EXTS_Pos                                     (4U)
#define    ADC_CFGR2_EXTS_Msk                                     (0xfU << ADC_CFGR2_EXTS_Pos)
#define    ADC_CFGR2_EXTS                                         ADC_CFGR2_EXTS_Msk

#define    ADC_CFGR2_OVRM_Pos                                     (8U)
#define    ADC_CFGR2_OVRM_Msk                                     (0x1U << ADC_CFGR2_OVRM_Pos)
#define    ADC_CFGR2_OVRM                                         ADC_CFGR2_OVRM_Msk

#define    ADC_CFGR2_CONT_Pos                                     (9U)
#define    ADC_CFGR2_CONT_Msk                                     (0x1U << ADC_CFGR2_CONT_Pos)
#define    ADC_CFGR2_CONT                                         ADC_CFGR2_CONT_Msk

#define    ADC_CFGR2_WAIT_Pos                                     (10U)
#define    ADC_CFGR2_WAIT_Msk                                     (0x1U << ADC_CFGR2_WAIT_Pos)
#define    ADC_CFGR2_WAIT                                         ADC_CFGR2_WAIT_Msk

#define    ADC_CFGR2_SEMI_Pos                                     (11U)
#define    ADC_CFGR2_SEMI_Msk                                     (0x1U << ADC_CFGR2_SEMI_Pos)
#define    ADC_CFGR2_SEMI                                         ADC_CFGR2_SEMI_Msk

#define    ADC_CFGR2_IOTRFEN_Pos                                  (14U)
#define    ADC_CFGR2_IOTRFEN_Msk                                  (0x1U << ADC_CFGR2_IOTRFEN_Pos)
#define    ADC_CFGR2_IOTRFEN                                      ADC_CFGR2_IOTRFEN_Msk

#define    ADC_CFGR2_OVSEN_Pos                                    (16U)
#define    ADC_CFGR2_OVSEN_Msk                                    (0x1U << ADC_CFGR2_OVSEN_Pos)
#define    ADC_CFGR2_OVSEN                                        ADC_CFGR2_OVSEN_Msk

#define    ADC_CFGR2_OVSR_Pos                                     (17U)
#define    ADC_CFGR2_OVSR_Msk                                     (0x7U << ADC_CFGR2_OVSR_Pos)
#define    ADC_CFGR2_OVSR                                         ADC_CFGR2_OVSR_Msk

#define    ADC_CFGR2_OVSS_Pos                                     (20U)
#define    ADC_CFGR2_OVSS_Msk                                     (0xfU << ADC_CFGR2_OVSS_Pos)
#define    ADC_CFGR2_OVSS                                         ADC_CFGR2_OVSS_Msk

#define    ADC_CFGR2_AWDEN_Pos                                    (24U)
#define    ADC_CFGR2_AWDEN_Msk                                    (0x1U << ADC_CFGR2_AWDEN_Pos)
#define    ADC_CFGR2_AWDEN                                        ADC_CFGR2_AWDEN_Msk

#define    ADC_CFGR2_AWDSC_Pos                                    (25U)
#define    ADC_CFGR2_AWDSC_Msk                                    (0x1U << ADC_CFGR2_AWDSC_Pos)
#define    ADC_CFGR2_AWDSC                                        ADC_CFGR2_AWDSC_Msk

#define    ADC_CFGR2_AWDCH_Pos                                    (26U)
#define    ADC_CFGR2_AWDCH_Msk                                    (0x1fU << ADC_CFGR2_AWDCH_Pos)
#define    ADC_CFGR2_AWDCH                                        ADC_CFGR2_AWDCH_Msk

#define    ADC_SMTR_SMTS1_Pos                                     (0U)
#define    ADC_SMTR_SMTS1_Msk                                     (0xfU << ADC_SMTR_SMTS1_Pos)
#define    ADC_SMTR_SMTS1                                         ADC_SMTR_SMTS1_Msk

#define    ADC_SMTR_SMTS2_Pos                                     (4U)
#define    ADC_SMTR_SMTS2_Msk                                     (0xfU << ADC_SMTR_SMTS2_Pos)
#define    ADC_SMTR_SMTS2                                         ADC_SMTR_SMTS2_Msk

