RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_adc.h
#define    ADC_DR_DATA_Pos                                        (0U)
#define    ADC_DR_DATA_Msk                                        (0xffffU << ADC_DR_DATA_Pos)
#define    ADC_DR_DATA                                            ADC_DR_DATA_Msk

#define    ADC_HLTR_AWD_LT_Pos                                    (0U)
#define    ADC_HLTR_AWD_LT_Msk                                    (0xffffU << ADC_HLTR_AWD_LT_Pos)
#define    ADC_HLTR_AWD_LT                                        ADC_HLTR_AWD_LT_Msk

#define    ADC_HLTR_AWD_HT_Pos                                    (16U)
#define    ADC_HLTR_AWD_HT_Msk                                    (0xffffU << ADC_HLTR_AWD_HT_Pos)
#define    ADC_HLTR_AWD_HT                                        ADC_HLTR_AWD_HT_Msk



#define    FL_ADC_EXTERNAL_CH0                                    (0x1U << 0U)
#define    FL_ADC_EXTERNAL_CH1                                    (0x1U << 1U)
#define    FL_ADC_EXTERNAL_CH2                                    (0x1U << 2U)
#define    FL_ADC_EXTERNAL_CH3                                    (0x1U << 3U)
#define    FL_ADC_EXTERNAL_CH4                                    (0x1U << 4U)
#define    FL_ADC_EXTERNAL_CH5                                    (0x1U << 5U)
#define    FL_ADC_EXTERNAL_CH6                                    (0x1U << 6U)
#define    FL_ADC_EXTERNAL_CH7                                    (0x1U << 7U)
#define    FL_ADC_EXTERNAL_CH8                                    (0x1U << 8U)
#define    FL_ADC_EXTERNAL_CH9                                    (0x1U << 9U)
#define    FL_ADC_EXTERNAL_CH10                                   (0x1U << 10U)
#define    FL_ADC_EXTERNAL_CH11                                   (0x1U << 11U)
#define    FL_ADC_EXTERNAL_CH12                                   (0x1U << 12U)
#define    FL_ADC_EXTERNAL_CH13                                   (0x1U << 13U)
#define    FL_ADC_EXTERNAL_CH14                                   (0x1U << 14U)
#define    FL_ADC_EXTERNAL_CH15                                   (0x1U << 15U)
#define    FL_ADC_EXTERNAL_CH16                                   (0x1U << 16U)
#define    FL_ADC_EXTERNAL_CH17                                   (0x1U << 17U)
#define    FL_ADC_EXTERNAL_CH18                                   (0x1U << 18U)
#define    FL_ADC_EXTERNAL_CH19                                   (0x1U << 19U)
#define    FL_ADC_INTERNAL_VREF1P2                                (0x1U << 24U)
#define    FL_ADC_INTERNAL_TS                                     (0x1U << 25U)
#define    FL_ADC_INTERNAL_AVREF                                  (0x1U << 26U)
#define    FL_ADC_INTERNAL_VBAT_DIV3                              (0x1U << 27U)
#define    FL_ADC_INTERNAL_VDD_DIV3                               (0x1U << 28U)
#define    FL_ADC_INTERNAL_DAC                                    (0x1U << 29U)
#define    FL_ADC_INTERNAL_OPA                                    (0x1U << 30U)
#define    FL_ADC_ALL_CHANNEL                                     (0xfffffU << 0U)


#define    FL_ADC_DIFFERENTIAL_GROUP0                             (0x1U << 0U)
#define    FL_ADC_DIFFERENTIAL_GROUP1                             (0x1U << 1U)
#define    FL_ADC_DIFFERENTIAL_GROUP2                             (0x1U << 2U)
#define    FL_ADC_DIFFERENTIAL_GROUP3                             (0x1U << 3U)
#define    FL_ADC_DIFFERENTIAL_GROUP4                             (0x1U << 4U)
#define    FL_ADC_DIFFERENTIAL_GROUP5                             (0x1U << 5U)
#define    FL_ADC_DIFFERENTIAL_GROUP6                             (0x1U << 6U)
#define    FL_ADC_CLK_PSC_DIV1                                    (0x0U << 0U)
#define    FL_ADC_CLK_PSC_DIV2                                    (0x1U << 0U)
#define    FL_ADC_CLK_PSC_DIV4                                    (0x2U << 0U)
#define    FL_ADC_CLK_PSC_DIV8                                    (0x3U << 0U)
#define    FL_ADC_CLK_PSC_DIV16                                   (0x4U << 0U)
#define    FL_ADC_CLK_PSC_DIV32                                   (0x5U << 0U)



#define    FL_ADC_TRIGGER_EDGE_NONE                               (0x0U << ADC_CR2_TRGCFG_Pos)
#define    FL_ADC_TRIGGER_EDGE_RISING                             (0x1U << ADC_CR2_TRGCFG_Pos)
#define    FL_ADC_TRIGGER_EDGE_FALLING                            (0x2U << ADC_CR2_TRGCFG_Pos)
#define    FL_ADC_TRIGGER_EDGE_BOTH                               (0x3U << ADC_CR2_TRGCFG_Pos)


#define    FL_ADC_REF_SOURCE_VDDA                                 (0x0U << ADC_CFGR1_PEFSEL_Pos)
#define    FL_ADC_REF_SOURCE_VREFP                                (0x1U << ADC_CFGR1_PEFSEL_Pos)
#define    FL_ADC_REF_SOURCE_VDD15                                (0x2U << ADC_CFGR1_PEFSEL_Pos)


#define    FL_ADC_CLK_SOURCE_ADCCLK                               (0x0U << ADC_CFGR1_CLKSEL_Pos)
#define    FL_ADC_CLK_SOURCE_APBCLK                               (0x1U << ADC_CFGR1_CLKSEL_Pos)


#define    FL_ADC_BIT_WIDTH_12B                                   (0x0U << ADC_CFGR1_BITSEL_Pos)
#define    FL_ADC_BIT_WIDTH_10B                                   (0x1U << ADC_CFGR1_BITSEL_Pos)
#define    FL_ADC_BIT_WIDTH_8B                                    (0x2U << ADC_CFGR1_BITSEL_Pos)
#define    FL_ADC_BIT_WIDTH_6B                                    (0x3U << ADC_CFGR1_BITSEL_Pos)


#define    FL_ADC_APBCLK_PSC_DIV1                                 (0x0U << ADC_CFGR1_APBCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV2                                 (0x1U << ADC_CFGR1_APBCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV4                                 (0x2U << ADC_CFGR1_APBCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV8                                 (0x3U << ADC_CFGR1_APBCLK_PSC_Pos)


#define    FL_ADC_BUFF_POWER_MODE_NORMAL                          (0x0U << ADC_CFGR1_BUFMOD_Pos)
#define    FL_ADC_BUFF_POWER_MODE_LOW                             (0x1U << ADC_CFGR1_BUFMOD_Pos)


#define    FL_ADC_BUFF_FILTER_MODE_NORMAL                         (0x0U << ADC_CFGR1_BUFLPF_Pos)
#define    FL_ADC_BUFF_FILTER_MODE_LOWPASS                        (0x1U << ADC_CFGR1_BUFLPF_Pos)


